In [1]:
import pandas as pd
import numpy as np

data = {
    "Customer_ID": list(range(101, 121)) * 6,  # 120 rows
    "Customer_Name": [
        "Ali", "Mariam", "Usman", "Tom", "Sana", "Zara", "Ahmed", "Bilal", "Nida", "Haris",
        "Ayesha", "Omar", "Sara", "Kashif", "Iqra", "Fahad", "Anum", "Usman", "Ali", "Mariam"
    ] * 6,
    "City": [
        "Karachi", "Lahore", "Multan", "Islamabad", "Karachi", "Lahore", "Multan", "Islamabad", "Karachi", "Lahore",
        "Multan", "Islamabad", "Karachi", "Lahore", "Multan", "Islamabad", "Karachi", "Lahore", "Multan", "Islamabad"
    ] * 6,
    "Product": [
        "Laptop", "Mobile", "Keyboard", "Mouse", "Monitor", "Laptop", "Mobile", "Keyboard", "Mouse", "Monitor",
        "Laptop", "Mobile", "Keyboard", "Mouse", "Monitor", "Laptop", "Mobile", "Keyboard", "Mouse", "Monitor"
    ] * 6,
    "Quantity": [
        1, 2, 1, 3, 2, 1, 2, 1, 3, 2,
        1, 2, 1, 3, 2, 1, 2, 1, 3, 2
    ] * 6,
    "Unit_Price": [
        1000, 500, 50, 25, 200, 1000, 500, 50, 25, 200,
        1000, 500, 50, 25, 200, 1000, 500, 50, 25, 200
    ] * 6,
    "Purchase_Date": pd.date_range(start="2025-01-01", periods=120, freq="D").tolist()
}

df = pd.DataFrame(data)

# Introduce some NaN values for cleaning practice
df.loc[5, "Customer_Name"] = None
df.loc[15, "Quantity"] = None
df.loc[25, "Unit_Price"] = None

df.head(10)

,Customer_ID,Customer_Name,City,Product,Quantity,Unit_Price,Purchase_Date
0,101,Ali,Karachi,Laptop,1.0,1000.0,2025-01-01
1,102,Mariam,Lahore,Mobile,2.0,500.0,2025-01-02
2,103,Usman,Multan,Keyboard,1.0,50.0,2025-01-03
3,104,Tom,Islamabad,Mouse,3.0,25.0,2025-01-04
4,105,Sana,Karachi,Monitor,2.0,200.0,2025-01-05
5,106,None,Lahore,Laptop,1.0,1000.0,2025-01-06
6,107,Ahmed,Multan,Mobile,2.0,500.0,2025-01-07
7,108,Bilal,Islamabad,Keyboard,1.0,50.0,2025-01-08
8,109,Nida,Karachi,Mouse,3.0,25.0,2025-01-09
9,110,Haris,Lahore,Monitor,2.0,200.0,2025-01-10

In [2]:
df

,Customer_ID,Customer_Name,City,Product,Quantity,Unit_Price,Purchase_Date
0,101,Ali,Karachi,Laptop,1.0,1000.0,2025-01-01
1,102,Mariam,Lahore,Mobile,2.0,500.0,2025-01-02
2,103,Usman,Multan,Keyboard,1.0,50.0,2025-01-03
3,104,Tom,Islamabad,Mouse,3.0,25.0,2025-01-04
4,105,Sana,Karachi,Monitor,2.0,200.0,2025-01-05
...,...,...,...,...,...,...,...
115,116,Fahad,Islamabad,Laptop,1.0,1000.0,2025-04-26
116,117,Anum,Karachi,Mobile,2.0,500.0,2025-04-27
117,118,Usman,Lahore,Keyboard,1.0,50.0,2025-04-28
118,119,Ali,Multan,Mouse,3.0,25.0,2025-04-29
119,120,Mariam,Islamabad,Monitor,2.0,200.0,2025-04-30

# Data Cleaning

In [5]:
df.duplicated().sum()

np.int64(0)

In [7]:
df["Customer_ID"].duplicated().sum()

np.int64(100)

In [15]:
df[df["Customer_ID"]=="30"]

Empty DataFrame
Columns: [Customer_ID, Customer_Name, City, Product, Quantity, Unit_Price, Purchase_Date]
Index: []

In [17]:
df.isnull().sum()

Customer_ID      0
Customer_Name    1
City             0
Product          0
Quantity         1
Unit_Price       1
Purchase_Date    0
dtype: int64

In [19]:
df=df.dropna(subset=["Customer_Name"])

In [20]:
df=df.dropna(subset=["Quantity"])

In [21]:
df=df.dropna(subset=["Unit_Price"])

In [22]:
df

,Customer_ID,Customer_Name,City,Product,Quantity,Unit_Price,Purchase_Date
0,101,Ali,Karachi,Laptop,1.0,1000.0,2025-01-01
1,102,Mariam,Lahore,Mobile,2.0,500.0,2025-01-02
2,103,Usman,Multan,Keyboard,1.0,50.0,2025-01-03
3,104,Tom,Islamabad,Mouse,3.0,25.0,2025-01-04
4,105,Sana,Karachi,Monitor,2.0,200.0,2025-01-05
...,...,...,...,...,...,...,...
115,116,Fahad,Islamabad,Laptop,1.0,1000.0,2025-04-26
116,117,Anum,Karachi,Mobile,2.0,500.0,2025-04-27
117,118,Usman,Lahore,Keyboard,1.0,50.0,2025-04-28
118,119,Ali,Multan,Mouse,3.0,25.0,2025-04-29
119,120,Mariam,Islamabad,Monitor,2.0,200.0,2025-04-30

In [23]:
df.dtypes

Customer_ID               int64
Customer_Name            object
City                     object
Product                  object
Quantity                float64
Unit_Price              float64
Purchase_Date    datetime64[ns]
dtype: object

In [26]:
df["Customer_Name"].duplicated().sum()

np.int64(100)

In [29]:
df["Customer_Name"]=df["Customer_Name"].drop_duplicates()

In [30]:
df

,Customer_ID,Customer_Name,City,Product,Quantity,Unit_Price,Purchase_Date
0,101,Ali,Karachi,Laptop,1.0,1000.0,2025-01-01
1,102,Mariam,Lahore,Mobile,2.0,500.0,2025-01-02
2,103,Usman,Multan,Keyboard,1.0,50.0,2025-01-03
3,104,Tom,Islamabad,Mouse,3.0,25.0,2025-01-04
4,105,Sana,Karachi,Monitor,2.0,200.0,2025-01-05
...,...,...,...,...,...,...,...
115,116,NaN,Islamabad,Laptop,1.0,1000.0,2025-04-26
116,117,NaN,Karachi,Mobile,2.0,500.0,2025-04-27
117,118,NaN,Lahore,Keyboard,1.0,50.0,2025-04-28
118,119,NaN,Multan,Mouse,3.0,25.0,2025-04-29
119,120,NaN,Islamabad,Monitor,2.0,200.0,2025-04-30

In [33]:
df=df.dropna(subset=["Customer_Name"])

In [34]:
df

,Customer_ID,Customer_Name,City,Product,Quantity,Unit_Price,Purchase_Date
0,101,Ali,Karachi,Laptop,1.0,1000.0,2025-01-01
1,102,Mariam,Lahore,Mobile,2.0,500.0,2025-01-02
2,103,Usman,Multan,Keyboard,1.0,50.0,2025-01-03
3,104,Tom,Islamabad,Mouse,3.0,25.0,2025-01-04
4,105,Sana,Karachi,Monitor,2.0,200.0,2025-01-05
6,107,Ahmed,Multan,Mobile,2.0,500.0,2025-01-07
7,108,Bilal,Islamabad,Keyboard,1.0,50.0,2025-01-08
8,109,Nida,Karachi,Mouse,3.0,25.0,2025-01-09
9,110,Haris,Lahore,Monitor,2.0,200.0,2025-01-10
10,111,Ayesha,Multan,Laptop,1.0,1000.0,2025-01-11
11,112,Omar,Islamabad,Mobile,2.0,500.0,2025-01-12
12,113,Sara,Karachi,Keyboard,1.0,50.0,2025-01-13
13,114,Kashif,Lahore,Mouse,3.0,25.0,2025-01-14
14,115,Iqra,Multan,Monitor,2.0,200.0,2025-01-15
16,117,Anum,Karachi,Mobile,2.0,500.0,2025-01-17
35,116,Fahad,Islamabad,Laptop,1.0,1000.0,2025-02-05
45,106,Zara,Lahore,Laptop,1.0,1000.0,2025-02-15